; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v2 - type_1 ?v1 - type_3)
 	      (pred_3 ?v3 - object ?v1 - type_3)
	      (pred_4 ?v2 - type_1 ?v8 - type_2)
	      (pred_2 ?v2 - type_1 ?v3 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v2 - type_1 ?v6 ?v7 - type_3)
       :precondition (and  (pred_1 ?v2 ?v6))
       :effect (and  (pred_1 ?v2 ?v7)
		     (not (pred_1 ?v2 ?v6))))

   (:action op_1
       :parameters (?v2 - type_1 ?v5 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v4) (pred_1 ?v2 ?v4) (pred_4 ?v2 ?v8))
       :effect (and (pred_2 ?v2 ?v5 ?v8)
		    (not (pred_3 ?v5 ?v4)) 
		    (not (pred_4 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_1 ?v5 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v5 ?v8) (pred_1 ?v2 ?v4))
       :effect (and (pred_3 ?v5 ?v4)
		    (pred_4 ?v2 ?v8)
		    (not (pred_2 ?v2 ?v5 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_13 - type_1
obj_03 obj_12 obj_05 obj_10 - type_2
obj_04 obj_07 obj_02 obj_09 - type_3
obj_06 obj_08 obj_11 - object)
(:init
(pred_1 obj_01 obj_04)
(pred_4 obj_01 obj_03)
(pred_4 obj_01 obj_12)
(pred_1 obj_13 obj_07)
(pred_4 obj_13 obj_05)
(pred_4 obj_13 obj_10)
(pred_3 obj_06 obj_04)
(pred_3 obj_08 obj_07)
(pred_3 obj_11 obj_02)
)
(:goal
(and
(pred_3 obj_06 obj_04)
(pred_3 obj_08 obj_07)
(pred_3 obj_11 obj_07)
)
)

(:constraints
  (always (not (pred_1 obj_01 obj_02)))
)
)

; plan
1. (op_3 obj_01 obj_04 obj_07)
   deleted: (pred_1 obj_01 obj_04)
   added: (pred_1 obj_01 obj_07)
   goals met: 2 of 3
2. (op_3 obj_13 obj_07 obj_02)
   deleted: (pred_1 obj_13 obj_07)
   added: (pred_1 obj_13 obj_02)
   goals met: 2 of 3
3. (op_1 obj_13 obj_11 obj_02 obj_10)
   deleted: (pred_3 obj_11 obj_02) (pred_4 obj_13 obj_10)
   added: (pred_2 obj_13 obj_11 obj_10)
   goals met: 2 of 3
4. (op_3 obj_13 obj_02 obj_07)
   deleted: (pred_1 obj_13 obj_02)
   added: (pred_1 obj_13 obj_07)
   goals met: 2 of 3
5. (op_2 obj_13 obj_11 obj_07 obj_10)
   deleted: (pred_2 obj_13 obj_11 obj_10)
   added: (pred_3 obj_11 obj_07) (pred_4 obj_13 obj_10)
   goals met: 3 of 3
